start_bottons = {
    'products_list' : "لیست محصولات 📦",
    'contact_us'    : "تماس با ما 📞",
    'user_account'  : "حساب کاربری 👤",
    'user_bag'      : "سبد خرید 🛒"
    }
default_ = {
    'undrestand'    : "متوجه منظورتان از ",
    'dont'          : "نمیشوم. ",
    'command'       : "برای راهنمایی از این دستور استفاده کنید: "
}
start_text = {
    'start'         : "سلام! به پتشاپ عطائی خوش آمدید. ",
    'menu'          : "چه کاری از دست من ساخته است؟"
}
help_ = {
    'main'          : "دستورات در دسترس:",
    'start'         : " شروع استفاده از بات ",
    'help'          : " اطلاعاتی درباره دستورات به شما می دهد ",
    'main_menu'     : " شما را به صفحه اصلی می برد ",
    'admin'         : "دستورات ادمین:",  
    'add_product'   : " اضافه کردن محصول جدید "
}
product_category = {
    'dog_food'      : "غذای سگ 🐶",
    'cat_food'      : "غذای گربه 🐱",
    'toy'          : "اسباب بازی 🧸",
    'tool'         : "وسایل بهداشتی 🪥",
    'furniture'     : "لوازم نگه داری 🛏"
    }
go_back_text = {
    'go_back'       : "بازگشت"
}
products_pannel = {
    'add_to_basket' : "افزودن به سبد خرید ✔️ ",
    'product_added' : " به سبد خرید شما اضافه شد ",
    'qty'           : " به تعداد ",
    'edit_basket'   : " ثبت تغییرات ✔️ ",
    'remove_from_basket' : " حذف کامل از سبد خرید 🗑"
}
admin_add_product = {
    'add_product'   : " لطفا به صورت زیر مشخصات محصول را همراه با عکس وارد کنید ",
    'product_name'  : " نام محصول: ",
    'price'         : " قیمت: ",
    'inventory'     : " موجودی: ",
    'category'      : " دسته بندی: ",
    'description'   : " توضیحات: ",
    'success'       : "محصول با موفقیت در دیتابیس و چنل ذخیره شد"
}
shopping_basket = {
    'shopping_cart'      : " سبد خرید شما: ",
    'name'               : " نام محصول: ",
    'qty'                : " تعداد: ",
    'price'              : " قیمت تک: ",
    'final_price'        : " قیمت کل: ",
    'remove_from_basket' : " حذف از سبد خرید ❌",
    'checkout'           : " تکمیل خرید ✅",
    'checkout_success'   : " خرید شما با موفقیت انجام شد. سفارش شما تا 5 روز کاری دیگر به دستتان خواهد رسید. ",
    'checkout_fail'      : " خرید شما با مشکلی در انجام شد. لطفا از کامل بودن حساب کاربری خود اطمینان حاصل شوید. ",
    'empty_bag'          : " سبد خرید شما خالی است ",
    'error_bag'          : " شما هنوز هیچ محصولی انتخواب نکرده اید ",
    'edit'               : " (حذف یا تغییر) ",
    'product_removed'    : " با موفقیت از سبد خرید شما حذف شد. "
}
user_account = {
    'user_account'  : "حساب کاربری",
    'first_name'    : "نام",
    'last_name'     : "نام خانوادگی",
    'phone_num'     : "شماره تلفن",
    'email'         : "ایمیل",
    'address'       : "آدرس",
    'zip_code'      : "کد پستی",
    'optional'      : "اختیاری",
    'edit1'         : "ویرایش یک مشخصه ✏️",
    'edit2'         : "ویرایش کل حساب کاربری 📝",
    'please'        : "لطفا ",
    'enter'         : " جدید خود را وارد کنید",
    'success'       : "مشخصات شما با موفقیت ثبت شد.",
    'skip'          : "گذر کردن",
    'choose'        : "لطفا یکی از مشخصه های زیر را انتخاب کنید.",
    'main_menu'     : "بازگشت به منو اصلی"
}
# companny's conections
companny_info = {
    'num'       : "02144667788",
    'address'   : "ی جایی اون دور دورا"
}
companny = {
    'num'       : "شماره تلفن: ",
    'address'   : "آدرس: ",
    'whats_app' : "واتساپ",
    'instagram' : "اینستاگرام",
    'telegram'  : "تلگرام",
    'telegram_support' : "پشتیبانی تلگرام",
    'message'   : "این پروژه هنوز صاحاب درست درمون نداره و فقط به عنوان نمونه کاره"
}